const t = {
  mk: {
    new: "Нови соопштенија",
    old: "Постари соопштенија",
    more: "Види повеќе",

    n1: "ИНТЕРЕН ОГЛАС за пополнување на работно место со унапредување на административен службеник",
    n1t: "Врз основа на член 30 став 1 алинеја 2 став 3 и став 5...",
    n2: "Одлука",
    n2t: "КПУ-КПД Идризово со Отворено одделение Велес го продолжува рокот...",
    n3: "ИНТЕРЕН ОГЛАС за пополнување на работни места со унапредување",
    n3t: "Врз основа на член 67 став 1 алинеја 2...",
    n4: "Предлог на одлука за избор на кандидати за унапредување",
    n4t: "Врз основа на член 52 став 1...",
    n5: "Одлука за поништување на оглас за вработување",
    n5t: "Врз основа на член 31 од Законот...",
    n6: "Одлука за избор на кандидати за унапредување",
    n6t: "Врз основа на член 52 од Законот за административни службеници...",

    o1: "Интерен оглас за вработување во затворска полиција",
    o1t: "Врз основа на член 78 и член 79...",
    o2: "Интерен оглас за вработување во администрација",
    o2t: "Врз основа на член 30 став 1...",
    o3: "Оглас за вработување на 18 лица на неопределено време",
    o3t: "Казнено-поправната установа објавува јавен оглас...",
    o4: "ЈАВЕН ОГЛАС за вработување на 70 лица",
    o4t: "Врз основа на член 67 став 1...",
    o5: "ЈАВЕН ОГЛАС за вработување на 30 лица",
    o5t: "Врз основа на член 67 став...",
    o6: "ОГЛАС за пополнување на работно место",
    o6t: "Врз основа на член 78..."
  },

  sq: {
    new: "Njoftime të reja",
    old: "Njoftime të vjetra",
    more: "Shiko më shumë"
  },

  en: {
    new: "New announcements",
    old: "Older announcements",
    more: "Read more"
  }
};

function setLanguage(lang) {
  document.querySelectorAll("[data-key]").forEach(el => {
    const key = el.dataset.key;
    el.textContent = t[lang][key] || t.mk[key];
  });

  localStorage.setItem("lang", lang);
}

setLanguage(localStorage.getItem("lang") || "mk");